from sys import stdout
from colorama import Fore, init
import os

def home_page():
        os.system("clear")
        stdout.write("                  ┃ "+Fore.GREEN   +"⮜═══════════════════════════════════════════════════════════════════════════════════⮞ ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"________             _____       _________                   ______                   ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"____  _/_______________  /______ __  ____/____________ _________  /______________     ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +" __  / __  __ \_  ___/  __/  __ `/  /    __  ___/  __ `/  ___/_  //_/  _ \_  ___/     ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"__/ /  _  / / /(__  )/ /_ / /_/ // /___  _  /   / /_/ // /__ _  ,<  /  __/  /         ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"/___/  /_/ /_//____/ \__/ \__,_/ \____/  /_/    \__,_/ \___/ /_/|_| \___//_/          ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"                                                                                      ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"       Author's Web-Site: TheWind.uz        Study Platform: HackNow.uz                ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"                         𝕻𝖗𝖔𝖌𝖗𝖆𝖒𝖒𝖊𝖉 𝖇𝖞 𝕬𝖐𝖍𝖆𝖙𝖐𝖚𝖑𝖔𝖛                                     ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"⮜═══════════════════════════════════════════════════════════════════════════════════⮞ ┃\n")
        stdout.write("\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"╔═════════════════════════════════════╦═════════════════════════════════════════════╗ ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"║   App's Target                      ║  Brute Force Attack for Instagram           ║ ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"║═════════════════════════════════════╬═════════════════════════════════════════════║ ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"║   Author                            ║  Akhatkulov Mekhroj                         ║ ┃\n")        
        stdout.write("                  ┃ "+Fore.GREEN   +"║═════════════════════════════════════╬═════════════════════════════════════════════║ ┃\n")
        stdout.write("                  ┃ "+Fore.GREEN   +"║   Guide                             ║  In README.md                               ║ ┃\n") 
        stdout.write("                  ┃ "+Fore.GREEN   +"║═════════════════════════════════════╬═════════════════════════════════════════════║ ┃\n")   # github.com/akhatkulov/InstaCracker-CLI
        stdout.write("                  ┃ "+Fore.GREEN   +"║   Github                            ║  github.com/akhatkulov/InstaCracker-CLI     ║ ┃\n") 
        stdout.write("                  ┃ "+Fore.GREEN   +"╚═════════════════════════════════════╩═════════════════════════════════════════════╝ ┃\n")